src/InformationRegisters/НастройкиОтправкиСообщенийОбОшибках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтправкиСообщенийОбОшибках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияДляОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/КритическиеСобытияПовтИсп/Ext/Module.bsl
Функция НеобходимоОпопвещение(Событие,ФлОпопвестить = ложь) Экспорт
	  если ФлОпопвестить тогда 
		  возврат Истина
	КонецЕсли;	  
	  
	  ЗапросСобытий  = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	  |	НастройкиОтправкиСообщенийОбОшибках.Пользователь
	  |ИЗ
	  |	РегистрСведений.НастройкиОтправкиСообщенийОбОшибках КАК НастройкиОтправкиСообщенийОбОшибках
	  |ГДЕ
	  |	НастройкиОтправкиСообщенийОбОшибках.Событие = &Событие");
	  ЗапросСобытий.УстановитьПараметр("Событие",Событие);
	  Результат = ЗапросСобытий.Выполнить();
	  
	  Возврат не Результат.Пустой() 
	  
  КонецФункции   
  
  
 Функция ТекущиеПараметрыРегламентногоЗадания(РегламентноеЗадание) Экспорт
	СтруктураПараметров = новый Структура; 
	Для каждого СтрокаШапки из РегламентноеЗадание.Шапка цикл 
		СтруктураПараметров.Вставить(СтрокаШапки.ИмяРеквизита,СтрокаШапки.ЗначениеРеквизита)		
	КонецЦикла;	
 
	Возврат СтруктураПараметров;
	  
	  
	  
КонецФункции
